app/Http/Controllers/Admin/Auth/RegisteredUserController.php

    public function store(Request $request)
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:admins'],
            // 'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = Admin::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `admins` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('test0001', 'test0001@gmail.com', '$2y$10$HTlFjmpnVinrQ1AqGqWm2uuzDw8zWEi3QHczAVOFhMyDG5TcgW40S', '2022-05-06 23:21:07', '2022-05-06 23:21:07')